// src/data/ranks.ts

export const RANK_VALUES: Record<number, number> = {
  0: 0, 1: 0, 2: 0,
  3: 1, 4: 2, 5: 3,
  6: 4, 7: 5, 8: 6,
  9: 7, 10: 8, 11: 9,
  12: 10, 13: 11, 14: 12,
  15: 13, 16: 14, 17: 15,
  18: 16, 19: 17, 20: 18,
  21: 19, 22: 20, 23: 21,
  24: 22,
  25: 24,
  26: 27,
  27: 40,
};

export const RANK_NAMES: Record<number, string> = {
  0: 'アンランク', 1: 'アンランク', 2: 'アンランク',
  3: 'アイアン1', 4: 'アイアン2', 5: 'アイアン3',
  6: 'ブロンズ1', 7: 'ブロンズ2', 8: 'ブロンズ3',
  9: 'シルバー1', 10: 'シルバー2', 11: 'シルバー3',
  12: 'ゴールド1', 13: 'ゴールド2', 14: 'ゴールド3',
  15: 'プラチナ1', 16: 'プラチナ2', 17: 'プラチナ3',
  18: 'ダイヤ1', 19: 'ダイヤ2', 20: 'ダイヤ3',
  21: 'アセンダント1', 22: 'アセンダント2', 23: 'アセンダント3',
  24: 'イモータル1', 25: 'イモータル2', 26: 'イモータル3',
  27: 'レディアント',
};

export const RANK_ICON_BASE = 'https://media.valorant-api.com/competitivetiers/03621f52-342b-cf4e-4f86-9350a49c6d04/';
